[Demo_Destiny_End_true GG2CollectionDemoScript]
DemoScripts[0]=(Actor=FADE,Command=SET,SecTime=0,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[1]=(Actor=DESTINY_GIRL,Command=IF,Name="アマツカ　パタコ",CId=21,Jump[0]="JUMP02",Jump[1]="JUMP01")
DemoScripts[2]=(Actor=SYSTEM,Command=TAG,Label=JUMP01)
DemoScripts[3]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=-30,Y=1170,Z=1335),SecTime=)
DemoScripts[4]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=180,Y=-5,Z=0),SecTime=)
DemoScripts[5]=(Actor=DESTINY_GIRL,Command=POP,Name="運命の彼女",Vec=(X=-220,Y=1170,Z=1200),VecSub=(X=0,Y=0,Z=0))
DemoScripts[6]=(Actor=CHARACTER,Command=POP,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',Vec=(X=590,Y=720,Z=-300),VecSub=(X=135,Y=0,Z=0),CId=71)
DemoScripts[7]=(Actor=SYSTEM,Command=INIT_WAIT)
DemoScripts[8]=(Actor=CHARACTER,Command=POP,Name="ホウダイ(主人公)",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.69_KAMIZONO_SHINOBU',Vec=(X=-160,Y=1170,Z=-300),VecSub=(X=180,Y=0,Z=0),CId=255)
DemoScripts[9]=(Actor=CHARACTER,Command=ACTION,Name="ホウダイ(主人公)",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.69_KAMIZONO_SHINOBU',motionName[0]="ho_DM_0100_lp_Stand",Number=9,CId=255,Bit=4)
DemoScripts[10]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0000_lp_open_normal",motionName[1]="ek_CM_0002_fx_close_smile_S",motionName[2]="ek_DM_0900_lp_Fly",Rate=0,Number=3,Bit=5)
DemoScripts[11]=(Actor=CHARACTER,Command=CHEEK,Name="運命の彼女",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.00_NITTA_SAYAKA',Rate=0.8,Number=1)
DemoScripts[12]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_End_Others.GG2_BGM_DM_End_Others_Cue')
DemoScripts[13]=(Actor=AMBIENT,Command=PLAY,SecTime=0,SoundID=SoundCue'AMB_Rooftop.GG2_AMB_Rooftop_LP_Cue')
DemoScripts[14]=(Actor=FADE,Command=EXIT,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[15]=(Actor=FADE,Command=WAIT)
DemoScripts[16]=(Actor=WINDOW,Command=SET)
DemoScripts[17]=(Actor=TEXT,Command=DESTINY_GIRL,Number=1)
DemoScripts[18]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[19]=(Actor=TEXT,Command=DESTINY_GIRL,Number=1)
DemoScripts[20]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[21]=(Actor=TEXT,Command=DESTINY_GIRL,Number=1)
DemoScripts[22]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[23]=(Actor=WINDOW,Command=EXIT)
DemoScripts[24]=(Actor=FADE,Command=SET,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[25]=(Actor=FADE,Command=WAIT)
DemoScripts[26]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=421,Y=1703,Z=1668),SecTime=)
DemoScripts[27]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=-137,Y=-29,Z=0),SecTime=)
DemoScripts[28]=(Actor=CHARACTER,Command=SET,Name="ホウダイ(主人公)",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.69_KAMIZONO_SHINOBU',SetType=POS,Vec=(X=-160,Y=1170,Z=1280),CId=255)
DemoScripts[29]=(Actor=CHARACTER,Command=SET,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',SetType=POS,Vec=(X=590,Y=720,Z=2000),CId=71)
DemoScripts[30]=(Actor=FADE,Command=EXIT,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[31]=(Actor=FADE,Command=WAIT)
DemoScripts[32]=(Actor=CAMERA,Command=MOVE,SetType=POS,Vec=(X=505,Y=1781,Z=1732),SecTime=10)
DemoScripts[33]=(Actor=WINDOW,Command=SET)
DemoScripts[34]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_End_after.GG2_V_DES_End_after_001_Cue',Name="エコロ")
DemoScripts[35]=(Actor=TEXT,Command=SET,ID=TEXT01)
DemoScripts[36]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[37]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_End_after.GG2_V_DES_End_after_002_Cue',Name="エコロ")
DemoScripts[38]=(Actor=TEXT,Command=SET,ID=TEXT02)
DemoScripts[39]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[40]=(Actor=CAMERA,Command=SET,SetType=POS_AND_ROT,Vec=(X=587,Y=912,Z=2090),VecSub=(X=-93,Y=8,Z=))
DemoScripts[41]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_End_after.GG2_V_DES_End_after_003_Cue',Name="エコロ")
DemoScripts[42]=(Actor=TEXT,Command=SET,ID=TEXT03)
DemoScripts[43]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[44]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0101_lp_close_smile",Rate=1,Number=0,Bit=1)
DemoScripts[45]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_End_after.GG2_V_DES_End_after_004_Cue',Name="エコロ")
DemoScripts[46]=(Actor=TEXT,Command=SET,ID=TEXT04)
DemoScripts[47]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[48]=(Actor=CAMERA,Command=SET,SetType=POS_AND_ROT,Vec=(X=321,Y=990,Z=2000),VecSub=(X=-45,Y=13,Z=))
DemoScripts[49]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0000_lp_open_normal",Rate=0,Number=0,Bit=1)
DemoScripts[50]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_End_after.GG2_V_DES_End_after_005_Cue',Name="エコロ")
DemoScripts[51]=(Actor=TEXT,Command=SET,ID=TEXT05)
DemoScripts[52]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[53]=(Actor=WINDOW,Command=EXIT)
DemoScripts[54]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0100_fx_close_normal",Rate=0,Number=0,Bit=0)
DemoScripts[55]=(Actor=CHARACTER,Command=MOVE,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',SetType=POS,Vec=(X=590,Y=720,Z=2030),SecTime=5,CId=71)
DemoScripts[56]=(Actor=SYSTEM,Command=WAIT,SecTime=1)
DemoScripts[57]=(Actor=SOUND,Command=PLAY,SoundID=SoundCue'SE_DM_Destiny_End_true.GG2_SE_DM_Ekoro_Effect_Cue')
DemoScripts[58]=(Actor=EMOTION,Command=SET,Name="エコロ",Number=12,CId=71)
DemoScripts[59]=(Actor=SYSTEM,Command=JUMP,Label=JUMP03)
DemoScripts[60]=(Actor=SYSTEM,Command=TAG,Label=JUMP02)
DemoScripts[61]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=-30,Y=1170,Z=1335),SecTime=)
DemoScripts[62]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=180,Y=-5,Z=0),SecTime=)
DemoScripts[63]=(Actor=CHARACTER,Command=POP,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',Vec=(X=-220,Y=1170,Z=1200),VecSub=(X=0,Y=0,Z=0),CId=21)
DemoScripts[64]=(Actor=SYSTEM,Command=INIT_WAIT)
DemoScripts[65]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[0]="pt_CE_0002_lp_open_perplex",motionName[1]="pt_CM_0002_fx_close_smile_S",motionName[2]="pt_DM_0100_lp_Stand",Rate=0,Number=3,Bit=5)
DemoScripts[66]=(Actor=DESTINY_GIRL,Command=CHEEK,Name="アマツカ　パタコ")
DemoScripts[67]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_End_Patako.GG2_BGM_DM_End_Patako_Cue')
DemoScripts[68]=(Actor=AMBIENT,Command=PLAY,SecTime=0,SoundID=SoundCue'AMB_Rooftop.GG2_AMB_Rooftop_LP_Cue')
DemoScripts[69]=(Actor=FADE,Command=EXIT,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[70]=(Actor=FADE,Command=WAIT)
DemoScripts[71]=(Actor=WINDOW,Command=SET)
DemoScripts[72]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_End_Patako.GG2_V_DES_Patako_End_001_Cue',Name="アマツカ　パタコ")
DemoScripts[73]=(Actor=TEXT,Command=SET,ID=TEXT06)
DemoScripts[74]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[75]=(Actor=TEXT,Command=SET,ID=TEXT07)
DemoScripts[76]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[0]="pt_CE_0101_fx_close_smile",Rate=0,Number=0,Bit=0)
DemoScripts[77]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[1]="pt_CM_0003_fx_close_smile_L",Rate=1,Number=1,Bit=0)
DemoScripts[78]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_End_Patako.GG2_V_DES_Patako_End_003_Cue',Name="アマツカ　パタコ")
DemoScripts[79]=(Actor=TEXT,Command=SET,ID=TEXT08)
DemoScripts[80]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[81]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_End_Patako.GG2_V_DES_Patako_End_004_Cue',Name="エコロ")
DemoScripts[82]=(Actor=TEXT,Command=SET,ID=TEXT09)
DemoScripts[83]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[84]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[0]="pt_CE_0000_lp_open_normal",Rate=0,Number=0,Bit=1)
DemoScripts[85]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[1]="pt_CM_0002_fx_close_smile_S",Rate=1,Number=1,Bit=0)
DemoScripts[86]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_End_Patako.GG2_V_DES_Patako_End_005_Cue',Name="アマツカ　パタコ")
DemoScripts[87]=(Actor=TEXT,Command=SET,ID=TEXT10)
DemoScripts[88]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[89]=(Actor=TEXT,Command=SET,ID=TEXT11)
DemoScripts[90]=(Actor=CAMERA,Command=MOVE,SetType=ROT,Vec=(X=180,Y=45,Z=0),SecTime=0.3)
DemoScripts[91]=(Actor=SYSTEM,Command=WAIT,SecTime=0.3)
DemoScripts[92]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=180,Y=45,Z=0),SecTime=)
DemoScripts[93]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_End_Patako.GG2_V_DES_Patako_End_007_Cue',Name="エコロ")
DemoScripts[94]=(Actor=TEXT,Command=SET,ID=TEXT12)
DemoScripts[95]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[96]=(Actor=WINDOW,Command=EXIT)
DemoScripts[97]=(Actor=SOUND,Command=PLAY,SoundID=SoundCue'SE_DM_Destiny_End_true.GG2_SE_DM_Crow_Cue')
DemoScripts[98]=(Actor=SYSTEM,Command=WAIT,SecTime=1)
DemoScripts[99]=(Actor=SYSTEM,Command=JUMP,Label=JUMP03)
DemoScripts[100]=(Actor=SYSTEM,Command=TAG,Label=JUMP03)
DemoScripts[101]=(Actor=FADE,Command=SET,SecTime=2,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[102]=(Actor=SYSTEM,Command=WAIT,SecTime=1)
DemoScripts[103]=(Actor=BGM,Command=STOP,SecTime=2,SoundID=)
DemoScripts[104]=(Actor=SYSTEM,Command=WAIT,SecTime=2)
DemoScripts[105]=(Actor=SYSTEM,Command=END)

[Select_Destiny_End_true GG2CollectionSelect]
Selects[0]=(Label="SELECT00",SelectNumber=5,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=NO_PARAM,ParamNum=0))
Selects[1]=(Label="SELECT01",SelectNumber=5,Select[0]=(TextLabel="SELECT06",Goto="JUMP06",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT07",Goto="JUMP07",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT08",Goto="JUMP08",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT09",Goto="JUMP09",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT10",Goto="JUMP10",ParamType=NO_PARAM,ParamNum=0))

[Text_Destiny_End_true GG2CollectionText]
Texts[0]=(Label="TEXT01",Name="艾可蘿",Text="呼......趕在時限前一刻結束了./n雖然令人捏了把冷汗,不過互相吸引的命運/n似乎讓兩位成功結合了呢.")

Texts[1]=(Label="TEXT02",Name="艾可蘿",Text="這樣一來我也能夠畢業,/n總算是告一段落了.")

Texts[2]=(Label="TEXT03",Name="艾可蘿",Text="峯大大人,請你好好珍惜/n命運的女朋友哦.")

Texts[3]=(Label="TEXT04",Name="艾可蘿",Text="如果做了劈腿之類的事/n可是會降下天罰的唷./n呵呵.")

Texts[4]=(Label="TEXT05",Name="艾可蘿",Text="那麼,願兩位能夠獲得/n天使的祝福....../n......再見.")

Texts[5]=(Label="TEXT06",Name="帕塔可",Text="學長......我已經神魂顛倒了!/n已經迷失自我了......")

Texts[6]=(Label="TEXT07",Name="峯大",Text="天使同學......不,帕塔可!/n今後就和我一起生活吧?")

Texts[7]=(Label="TEXT08",Name="帕塔可",Text="好的!/n現在就可以!!")

Texts[8]=(Label="TEXT09",Name="艾可蘿",Text="不行啦!/n帕塔可學姊!/n請振作一點啊!!")

Texts[9]=(Label="TEXT10",Name="帕塔可",Text="妳很囉唆耶,艾可蘿./n......學長~!/n下次和帕塔可一起玩生存遊戲吧?")

Texts[10]=(Label="TEXT11",Name="峯大",Text="還請妳手下留情.")

Texts[11]=(Label="TEXT12",Name="艾可蘿",Text="啊~!!/n就說了,不行啦~!!")

Texts[12]=(Label="",Name="",Text="")

Texts[13]=(Label="SELECT01",Name="",Text="")

Texts[14]=(Label="SELECT02",Name="",Text="")

Texts[15]=(Label="SELECT03",Name="",Text="")

Texts[16]=(Label="SELECT04",Name="",Text="")

Texts[17]=(Label="SELECT05",Name="",Text="")

Texts[18]=(Label="SELECT06",Name="",Text="")

Texts[19]=(Label="SELECT07",Name="",Text="")

Texts[20]=(Label="SELECT08",Name="",Text="")

Texts[21]=(Label="SELECT09",Name="",Text="")

Texts[22]=(Label="SELECT10",Name="",Text="")


